Функция courier_task_POST(Запрос)
	Пользователь = Справочники.Клиенты.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Новый HTTPСервисОтвет(403);
	КонецЕсли;

	ТелоЗапроса = КоннекторХТТП.JsonВОбъект(Запрос.ПолучитьТелоКакПоток());
	ПараметрыСоздания = КурьеркиеЗаявки.НовыйДанныеСозданияЗаявки();
	ПараметрыСоздания.Автор = Пользователь;
	ПараметрыСоздания.Адрес = ТелоЗапроса.Получить("address");
	ПараметрыСоздания.Комментарий = ТелоЗапроса.Получить("comment");

	НоваяЗаявка = КурьеркиеЗаявки.СоздатьНовуюКурьерскуюЗаявку(ПараметрыСоздания);
	ДанныеЗаявки = КурьерскиеЗаявкиИнтеграция.ДанныеЗаявкиВФормате(НоваяЗаявка);
	Ответ = Новый HTTPСервисОтвет(201);
	Ответ.УстановитьТелоИзСтроки(КоннекторХТТП.ОбъектВJson(ДанныеЗаявки));
	Возврат Ответ;
КонецФункции
