

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Статус = СтатусЗаявки(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусЗаявки(Заявка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатусыКурьерскихЗаявокСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыКурьерскихЗаявок.СрезПоследних КАК СтатусыКурьерскихЗаявокСрезПоследних
	|ГДЕ
	|	СтатусыКурьерскихЗаявокСрезПоследних.Заявка = &Заявка");

	Запрос.УстановитьПараметр("Заявка", Заявка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", Статус);
КонецПроцедуры

