#Область ПрограммныйИнтерфейс

Функция НайтиПользователя(ИдентификаторПользователя) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.ИдентификаторПользователя = &ИдентификаторПользователя";

	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ТекущийПользователь() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.ИдентификаторПользователяБД = &ИдентификаторПользователя";

	Запрос.УстановитьПараметр(
		"ИдентификаторПользователя",
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор
	);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти