

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		НовПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовПользовательИБ.Имя = СтрЗаменить(Наименование, " ", "");
		НовПользовательИБ.АутентификацияСтандартная = Истина;
		НовПользовательИБ.Роли.Добавить(Метаданные.Роли.ВнешнийПользователь);
		НовПользовательИБ.Записать();
		ИдентификаторПользователяБД = НовПользовательИБ.УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры
